app/controllers/api/available_slots_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bookings"."slot" FROM "bookings" WHERE "bookings"."event_id" = ? AND (DATE(slot) = ?)  [["event_id", 1], [nil, "2026-04-05"]]
---
  def index
    event_id = params[:event_id]
    date = params[:date]

    if event_id.blank? || date.blank?
      render json: { error: "event_id and date are required" }, status: :bad_request
      return
    end

    event = Event.find(event_id)
    occupied_slots = Booking.where(event_id: event_id)
                           .where("DATE(slot) = ?", date)
                           .pluck(:slot)