app/controllers/api/bookings_controller.rb

  def index
    bookings = Booking.includes(:event)

    # Apply filters
    if params[:status].present?
      bookings = bookings.where(status: params[:status])
    end

    if params[:event_id].present?
      bookings = bookings.where(event_id: params[:event_id])
    end

    if params[:from_date].present? && params[:to_date].present?
      bookings = bookings.where(slot: params[:from_date]..params[:to_date])
    elsif params[:from_date].present?
      bookings = bookings.where("slot >= ?", params[:from_date])
---
SELECT "bookings".* FROM "bookings"
SELECT "events".* FROM "events" WHERE "events"."id" = ?  [["id", 1]]