app/controllers/api/owner_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."event_id" = ?  [["event_id", 2]]
SELECT "events".* FROM "events" WHERE "events"."owner_id" = ?  [["owner_id", 1]]
SELECT "bookings".* FROM "bookings" INNER JOIN "events" ON "bookings"."event_id" = "events"."id" WHERE "events"."owner_id" = ? ORDER BY "bookings"."slot" ASC  [["owner_id", 1]]
---
  def dashboard
    @events = @owner.events.includes(:bookings)
    @all_bookings = @owner.bookings.includes(:event).order(:slot)

SELECT "events".* FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
  def delete_event
    @event = @owner.events.find(params[:id])

SELECT "bookings".* FROM "bookings" INNER JOIN "events" ON "bookings"."event_id" = "events"."id" WHERE "events"."owner_id" = ? ORDER BY "bookings"."slot" ASC  [["owner_id", 1]]
---
  def bookings
    @bookings = @owner.bookings.includes(:event).order(:slot)