app/controllers/api/public_controller.rb

  def events
    @events = Event.all.includes(:owner)
---
SELECT "events".* FROM "events"
SELECT "owners".* FROM "owners" ORDER BY "owners"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def event
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_booking
    @booking = Booking.new(booking_params)

    if @booking.save
---
INSERT INTO "bookings" ("event_id", "slot", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["event_id", 2], ["slot", "2026-04-05 14:00:00"], ["created_at", "2026-04-05 14:57:47.747638"], ["updated_at", "2026-04-05 14:57:47.747638"]]