app/models/booking.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."slot" = ? AND "bookings"."id" IS NOT NULL ORDER BY "bookings"."id" ASC LIMIT ?  [["slot", "2026-04-05 14:00:00"], ["LIMIT", 1]]
---
  def slot_not_booked
    existing_booking = Booking.where(slot: slot).where.not(id: id).first